PureEngineering/PUREmodules/nrf52/modules_examples/dw1000_TX/main.cpp
#include <stdint.h>
#include <string.h>
#include <string>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "nrf_gpio.h"
#include "app_util_platform.h"
#include "bsp.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <string>


#include "bsp_btn_ble.h"
#include "DW1000Time.h"
#include "DW1000.h"
#include "nrf_drv_spi.h"
#include "main.h"
#include "nrf_delay.h"



#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE            GATT_MTU_SIZE_DEFAULT                       /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define CENTRAL_LINK_COUNT              0                                           /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1                                           /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME                     "DW1000"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  /**< Universally unique service identifier. */


#define DEBUG_PRINTF(...) printf( __VA_ARGS__); 
//#define DEBUG_PRINTF(...)

// /////////////////////////////////////////

 //#define SPI_INSTANCE  2 /**< SPI instance index. */
 //static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
 //static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

 void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
 {
 	spi_xfer_done = true;
 }


 //static const nrf_drv_twi_t m_twi_master = NRF_DRV_TWI_INSTANCE(MASTER_TWI_INST);

////////////////////////////
typedef struct
{
	//volatile char q[QUEUESIZE+1];		/* body of queue */
	volatile char *q;		/* pointer to queue buffer*/
	volatile int read_index;                 /* index used for reading */
	volatile int write_index;                /* index used for writing */
	volatile int size;			/* size of queue */
} queue;

void init_queue(queue *q,char* buffer, int size)
{
	q->read_index = 0;
	q->write_index = 0;
	q->size = size-1;
	q->q = buffer;
}

int put_queue(queue *q, char x)
{
	int nextindex = (q->write_index + 1) % q->size;
	if(nextindex != q->read_index)
	{
		q->q[q->write_index] = x;
		q->write_index = nextindex;

		return 1;
	}
	else
	{
		return 0; //queue is full
	}
}

int get_queue(queue *q,char *x)
{
	if(q->read_index == q->write_index)
	{
		return 0; //queue is empty
	}

	int nextindex = (q->read_index + 1) % q->size;
	*x = q->q[q->read_index];
	q->read_index = nextindex;

	return 1;
}


queue uart_rx_queue;
queue ble_rx_queue;
queue ble_tx_queue;

