PureEngineering/PUREmodules/nrf52/modules_examples/dw1000_TX/main.cpp
bool sent = false;
volatile bool sentAck = false;
volatile unsigned long delaySent = 0;
int16_t sentNum = 0;
DW1000Time sentTime;


void handleSent(){
	sentAck = false;
}


void dw1000TX(){
	DEBUG_PRINTF("DW1000 TX #: %d \r\n", sentNum);
	DW1000.newTransmit();
	DW1000.setDefaults();

	char senddata[16];
	sprintf(senddata, "Hello world: %d", sentNum);
	DEBUG_PRINTF("DW1000 sendata: %s \r\n", senddata);

	DW1000.setData((uint8_t*)senddata,16);

	DW1000Time delayTime = DW1000Time(10, DW1000Time::MILLISECONDS);

	DW1000.setDelay(delayTime);
	DW1000.startTransmit();

}


/**@brief Application main function.
*/
int main(void)
{
	//uint32_t err_code;
	bool erase_bonds;

	nrf_gpio_pin_dir_set(18,NRF_GPIO_PIN_DIR_INPUT);
	//Initialize.
	APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, 0);

	buttons_leds_init(&erase_bonds);
	//ble_stack_init();
	gap_params_init();
	services_init();
	advertising_init();
	conn_params_init();
	
	uart_init();
	DEBUG_PRINTF("\n\rOFC\n\r");

	// ///////////////

	init_queue(&uart_rx_queue,uart_rx_buffer,MAX_QUEUE_SIZE);
	init_queue(&ble_rx_queue,ble_rx_buffer,MAX_QUEUE_SIZE);
	init_queue(&ble_tx_queue,ble_tx_buffer,MAX_QUEUE_SIZE);


	nrf_gpio_cfg_output(8);
	nrf_gpio_pin_clear(8);  //turn off GPS

	//SPI setup
	nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
	spi_config.ss_pin   = SPI_SS_PIN;
	spi_config.miso_pin = SPI_MISO_PIN;
	spi_config.mosi_pin = SPI_MOSI_PIN;
	spi_config.sck_pin  = SPI_SCK_PIN;

	APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));
	
	//Set output on pin 14
	nrf_gpio_pin_dir_set(14,NRF_GPIO_PIN_DIR_OUTPUT);
	nrf_gpio_pin_set(14);  
	DEBUG_PRINTF("DW1000 Reset\n\r");
	nrf_gpio_pin_dir_set(14,NRF_GPIO_PIN_DIR_INPUT);
	
	DEBUG_PRINTF("DW1000 Init\n\r");

	DW1000.newConfiguration(); 
	DW1000.setDefaults();
	DW1000.setDeviceAddress(5);
  	DW1000.setNetworkId(10);
  	DW1000.enableMode(DW1000.MODE_LONGDATA_RANGE_LOWPOWER);
  	DW1000.commitConfiguration();  
	DW1000.printDeviceData();

	DW1000.attachSentHandler(handleSent);
	dw1000TX();


	// DEBUG_PRINTF("BLE Start\n\r");
	//err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
	//APP_ERROR_CHECK(err_code);

	// DEBUG_PRINTF("App Loop\n\r");
	// Enter main loop.
	for (;;)
	{

		if(!sentAck){
			return -1;
		}

		sentAck = false;
		DW1000Time newSentTime;
		DW1000.getTransmitTimestamp(newSentTime);
		DEBUG_PRINTF("Processed packet # %d \n\r", sentNum);
		DEBUG_PRINTF("Sent timestamp %lld \n\r", newSentTime.getTimestamp());
		DEBUG_PRINTF("Dw1000 delta send time(ms)%lld \n\r", newSentTime.getTimestamp()-sentTime.getTimestamp() );
		sentTime = newSentTime;
		sentNum++;
		dw1000TX();


	}
}


/**
 * @}
 */
